Xml-integration-demo/HotelRQ/20210407142857115HotelCancellationPolicy.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><env:Envelope xmlns:env="http://www.w3.org/2003/05/soap-envelope" xmlns:hot="http://TekTravel/HotelBookingApi" xmlns:soap="http://www.w3.org/2003/05/soap-envelope"><env:Header xmlns:wsa="http://www.w3.org/2005/08/addressing"><hot:Credentials Password="Sra@12896022" UserName="WESARA"/><wsa:Action>http://TekTravel/HotelBookingApi/HotelCancellationPolicy</wsa:Action><wsa:To>https://api.tboholidays.com/HotelApi_V7/HotelService.svc</wsa:To></env:Header><env:Body><HotelCancellationPolicyRequest xmlns="http://TekTravel/HotelBookingApi"><ResultIndex>1</ResultIndex><SessionId>132ed4ff-03e5-42dd-975f-cafe9cf90733</SessionId><OptionsForBooking><FixedFormat>true</FixedFormat><RoomCombination><RoomIndex>2</RoomIndex></RoomCombination></OptionsForBooking></HotelCancellationPolicyRequest></env:Body></env:Envelope>